# GetBoundingElementsForSpaceVolume Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuildingEnvelopeAnalyzer..::..GetBoundingElementsForSpaceVolume Method
BuildingEnvelopeAnalyzer Class See Also
---
Returns the collection of bounding building elements for an enclosed space volume.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<LinkElementId> GetBoundingElementsForSpaceVolume(
	int spaceVolume
)
```

Visual Basic
---
```text
Public Function GetBoundingElementsForSpaceVolume ( _
	spaceVolume As Integer _
) As IList(Of LinkElementId)
```

Visual C++
---
```text
public:
IList<LinkElementId^>^ GetBoundingElementsForSpaceVolume(
	int spaceVolume
)
```

# ### Parameters
spaceVolume
    Type: System..::..Int32
# ### Return Value
The ids of the bounding building elements for the enclosed space volume.
# Remarks
This method requires the building envelope analyzer method created with the option set to compute enclosed space volumes.
# See Also
BuildingEnvelopeAnalyzer Class
Autodesk.Revit.DB.Analysis Namespace